<p style="font-size:30px; text-align:center; line-height:120%">
<br>
COMS W 4111-02 Fall 2020<br>
Introduction to Databases<br>
Homework 1c: Programming Track<br>

</p>

# Overview and Instructions

In this part of homework 1c, you will have to:
- Clean up data from the Lahman baseball database
- Write a sql query to get the career stats of a given player. 

__Assignment Due Date: Sunday, October 11, 11:59pm__

<hr style="height:2px">

## Part 0: Import Data + Database Connection

### Load the data:
- Download the .dump file provided in the assignment on courseworks
- Open workbench, click 'Data Import/Restore' under Management
- Select 'Import from Self-Contained File' and either provide the path in the text box to the .dump file or click on the three dots to the right to find the file
- Under "Defult Target Schema to Load into" click new and name the schema ```lahman2019```
- Click 'Start Import' on the bottom right to begin

### Connect to the schema you just created:

In [2]:
%load_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/lahman2019

<hr style="height:2px">

## Part 1: Data Cleanup
Data cleanup: For each table we want you to clean, we have provided a list of changes you have to make. You should make these changes through sql workbench's table editor and using sql queries. In this part you will clean two tables: People and Batting. 


### You must have: 
- A brief explanation of why we asked you to make each change
- What change you made to the table
- Any queries you used to make the changes, either the ones you wrote or the Alter statements provided by SQL workbench's table editor. 
- Executed the test statements we provided
- The cleaned table's new create statement (after you finish all the changes) 

### Overview of Changes:

People Table 

   0. Primary Key (Explanation is given, but you still must add the key to your table yourself)
   1. Empty strings to NULLs
   2. Column typing
   3. isDead column
   4. deathDate and birthDate column

Batting Table

   1. Empty strings to NULLs
   2. Column typing
   3. Primary Key
   4. Foreign Key
   
### How to make the changes: 

__Using the Table Editor:__

When you hit apply, a popup will open displaying the ALTER statments sql generates. Copy the sql provided first and paste it into this notebook. Then you can apply the changes. This means that you are NOT executing the ALTER statements through your notebook. 


<img src="workbench_table_editor.png">

<img src="workbench_apply_changes.png">


__Using sql queries:__

Copy paste any queries that you write manually into the notebook as well!


<hr style="height:2px">

## People Table

### 0) Add a Primary Key (Solutions are given but make sure you still do this step in workbench!!)

#### Explanation

We want to add a Primary Key because we want to be able to uniquely identify rows within our data. A primary key is also an index, which allows us to locate data faster.

#### Change

I added a Primary Key on the playerID column and made the datatype VARCHAR(15)

#### SQL

~~~~sql
ALTER TABLE `lahman2017`.`fielding`
CHANGE COLUMN `playerID` `playerID` VARCHAR(15) NOT NULL ,
ADD PRIMARY KEY (`playerID`);
~~~~

#### Tests

In [34]:
%sql SHOW KEYS FROM people WHERE Key_name = 'PRIMARY'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('people', 0, 'PRIMARY', 1, 'playerID', 'A', 19480, None, None, '', 'BTREE', '', '', 'YES', None)]

### 1) Convert all empty strings to NULL

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [5]:
%sql SELECT * FROM people WHERE birthState = ""

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

### 2) Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

### 3) Add an isDead Column that is either 'Y' or 'N'
Some things to think of: What data type should this column be? How do you know if the player is dead or not?

'Y' means the player is dead

'N' means the player is alive

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [6]:
%sql SELECT * FROM people WHERE isDead = "N" limit 10

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('aardsda01', '1981', '12', '27', 'USA', 'CO', 'Denver', None, None, None, None, None, None, 'David', 'Aardsma', 'David Allan', 215, '75', 'R', 'R', '2004-04-06', '2015-08-23', 'aardd001', 'aardsda01', datetime.datetime(1981, 12, 27, 0, 0), None, 'N'),
 ('aaronha01', '1934', '2', '5', 'USA', 'AL', 'Mobile', None, None, None, None, None, None, 'Hank', 'Aaron', 'Henry Louis', 180, '72', 'R', 'R', '1954-04-13', '1976-10-03', 'aaroh101', 'aaronha01', datetime.datetime(1934, 2, 5, 0, 0), None, 'N'),
 ('aasedo01', '1954', '9', '8', 'USA', 'CA', 'Orange', None, None, None, None, None, None, 'Don', 'Aase', 'Donald William', 190, '75', 'R', 'R', '1977-07-26', '1990-10-03', 'aased001', 'aasedo01', datetime.datetime(1954, 9, 8, 0, 0), None, 'N'),
 ('abadan01', '1972', '8', '25', 'USA', 'FL', 'Palm Beach', None, None, None, None, None, None, 'Andy', 'Abad', 'Fausto Andres', 184, '73', 'L', 'L', '2001-09-10', '2006-04-13', 'abada001', 'abadan01', datetime.datetime(1972, 8, 25, 0, 0), None, 'N'),
 ('abadfe01', '1985', '12', '17', 'D.R.', 'La Romana', 'La Romana', None, None, None, None, None, None, 'Fernando', 'Abad', 'Fernando Antonio', 220, '73', 'L', 'L', '2010-07-28', '2017-10-01', 'abadf001', 'abadfe01', datetime.datetime(1985, 12, 17, 0, 0), None, 'N'),
 ('abbotgl01', '1951', '2', '16', 'USA', 'AR', 'Little Rock', None, None, None, None, None, None, 'Glenn', 'Abbott', 'William Glenn', 200, '78', 'R', 'R', '1973-07-29', '1984-08-08', 'abbog001', 'abbotgl01', datetime.datetime(1951, 2, 16, 0, 0), None, 'N'),
 ('abbotje01', '1972', '8', '17', 'USA', 'GA', 'Atlanta', None, None, None, None, None, None, 'Jeff', 'Abbott', 'Jeffrey William', 190, '74', 'R', 'L', '1997-06-10', '2001-09-29', 'abboj002', 'abbotje01', datetime.datetime(1972, 8, 17, 0, 0), None, 'N'),
 ('abbotji01', '1967', '9', '19', 'USA', 'MI', 'Flint', None, None, None, None, None, None, 'Jim', 'Abbott', 'James Anthony', 200, '75', 'L', 'L', '1989-04-08', '1999-07-21', 'abboj001', 'abbotji01', datetime.datetime(1967, 9, 19, 0, 0), None, 'N'),
 ('abbotku01', '1969', '6', '2', 'USA', 'OH', 'Zanesville', None, None, None, None, None, None, 'Kurt', 'Abbott', 'Kurt Thomas', 180, '71', 'R', 'R', '1993-09-07', '2001-04-13', 'abbok002', 'abbotku01', datetime.datetime(1969, 6, 2, 0, 0), None, 'N'),
 ('abbotky01', '1968', '2', '18', 'USA', 'MA', 'Newburyport', None, None, None, None, None, None, 'Kyle', 'Abbott', 'Lawrence Kyle', 200, '76', 'L', 'L', '1991-09-10', '1996-08-24', 'abbok001', 'abbotky01', datetime.datetime(1968, 2, 18, 0, 0), None, 'N')]

### 4) Add a deathDate and birthDate column
Some things to think of: What do you do if you are missing information? What datatype should this column be?

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [9]:
%sql SELECT deathDate FROM people WHERE deathDate >= '2005-01-01' ORDER BY deathDate ASC LIMIT 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[(datetime.datetime(2005, 1, 4, 0, 0),),
 (datetime.datetime(2005, 1, 7, 0, 0),),
 (datetime.datetime(2005, 1, 9, 0, 0),),
 (datetime.datetime(2005, 1, 10, 0, 0),),
 (datetime.datetime(2005, 1, 21, 0, 0),),
 (datetime.datetime(2005, 1, 22, 0, 0),),
 (datetime.datetime(2005, 1, 31, 0, 0),),
 (datetime.datetime(2005, 2, 4, 0, 0),),
 (datetime.datetime(2005, 2, 8, 0, 0),),
 (datetime.datetime(2005, 2, 11, 0, 0),)]

In [10]:
%sql SELECT birthDate FROM people WHERE birthDate <= '1965-01-01' ORDER BY birthDate ASC LIMIT 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[(datetime.datetime(1820, 4, 17, 0, 0),),
 (datetime.datetime(1824, 10, 5, 0, 0),),
 (datetime.datetime(1832, 2, 25, 0, 0),),
 (datetime.datetime(1832, 9, 17, 0, 0),),
 (datetime.datetime(1832, 10, 23, 0, 0),),
 (datetime.datetime(1835, 1, 10, 0, 0),),
 (datetime.datetime(1836, 2, 29, 0, 0),),
 (datetime.datetime(1837, 12, 26, 0, 0),),
 (datetime.datetime(1838, 3, 10, 0, 0),),
 (datetime.datetime(1838, 7, 16, 0, 0),)]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
Put your answer in this cell
~~~~

<hr style="height:2px">

## Batting Table

### 1) Convert all empty strings to NULL

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [11]:
%sql SELECT count(*) FROM lahman2019clean.batting where RBI is NULL;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[(756,)]

### 2) Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

### 3) Add a Primary Key
Two options for the Primary Key:

- Composite Key: playerID, yearID, stint
- Covering Key: playerID, yearID, stint, teamID


#### Choice

_Put your answer in this cell_

#### Explanation

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Test

In [33]:
%sql SHOW KEYS FROM batting WHERE Key_name = 'PRIMARY' and Column_name = 'playerID'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('batting', 0, 'PRIMARY', 1, 'playerID', 'A', 20242, None, None, '', 'BTREE', '', '', 'YES', None)]

### 4) Add a foreign key on playerID between the People and Batting Tables
Note: Two people in the batting table do not exist in the people table. How should you handle this issue?

#### Explanation

_Put your answer in this cell_

#### Change

_Put your answer in this cell_

#### SQL

~~~~sql
Put your answer in this cell
~~~~

#### Tests

In [12]:
%sql Select playerID from batting where playerID not in (select playerID from people);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
Put your answer in this cell
~~~~

<hr style="height:2px">

## Part 2: Career Highlights of Award Winning Players


- Find the ```playerID, firstName, lastName, number of awards, number of games played and number of home runs```, for every player.


- Group the entries by ```playerID``` and order by descending ```number of awards``` values

- You need to return 10 rows.

- Hint the ```IFNULL()``` command helps when joining tables

<u>Answer:</u>

#### Run your query

~~~~sql
Put your answer in this cell
~~~~

#### Expected output

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('bondsba01', 'Barry', 'Bonds', 47, 2986.0, 762.0),
 ('willite01', 'Ted', 'Williams', 39, 2292.0, 521.0),
 ('dimagjo01', 'Joe', 'DiMaggio', 36, 1736.0, 361.0),
 ('musiast01', 'Stan', 'Musial', 34, 3026.0, 475.0),
 ('johnswa01', 'Walter', 'Johnson', 33, 937.0, 2541.0),
 ('ruthba01', 'Babe', 'Ruth', 33, 2504.0, 7360.0),
 ('schmimi01', 'Mike', 'Schmidt', 33, 2404.0, 548.0),
 ('mayswi01', 'Willie', 'Mays', 32, 2992.0, 660.0),
 ('robinbr01', 'Brooks', 'Robinson', 32, 2896.0, 268.0),
 ('cobbty01', 'Ty', 'Cobb', 31, 3034.0, 234.0)]